In [1]:
import numpy as np
import pandas as pd

In [76]:
test_dict = {'id':[1,2,3,4,5,6],'name':['Alice','Bob','Cindy','Eric','Helen','Grace '],'math':[90,89,99,78,97,93],'english':[89,94,80,94,94,90]}
test_dict_df = pd.DataFrame(test_dict)

In [77]:
test_dict_df.loc[7]=[88,8,92,'Tim']
test_dict_df

   english  id  math    name
0       89   1    90   Alice
1       94   2    89     Bob
2       80   3    99   Cindy
3       94   4    78    Eric
4       94   5    97   Helen
5       90   6    93  Grace
7       88   8    92     Tim

In [19]:
# test_dict_df.loc[1]
test_dict_df.loc[7]
# type(test_dict_df.loc[1]) #pandas.core.series.Series

english     88
id           8
math        92
name       Tim
Name: 7, dtype: object

In [27]:
# test_dict_df.loc[[1,2,4]]
test_dict_df.loc[1:4]

   english  id  math   name
1       94   2    89    Bob
2       80   3    99  Cindy
3       94   4    78   Eric
4       94   5    97  Helen

In [26]:
test_dict_df.loc[1,'english']

94

In [28]:
test_dict_df.loc[1:4,'english']

1    94
2    80
3    94
4    94
Name: english, dtype: int64

In [30]:
test_dict_df.loc[1:4,'english':'math']

   english  id  math
1       94   2    89
2       80   3    99
3       94   4    78
4       94   5    97

In [31]:
test_dict_df.loc[test_dict_df['english']>90]

   english  id  math   name
1       94   2    89    Bob
3       94   4    78   Eric
4       94   5    97  Helen

In [33]:
test_dict_df.loc[test_dict_df['english']>90,'english']

1    94
3    94
4    94
Name: english, dtype: int64

In [34]:
test_dict_df.loc[test_dict_df['english']>90,'english':'name']

   english  id  math   name
1       94   2    89    Bob
3       94   4    78   Eric
4       94   5    97  Helen

In [35]:
test_dict_df.loc[test_dict_df['english']>90,['english','name']]

   english   name
1       94    Bob
3       94   Eric
4       94  Helen

In [57]:
test_dict_df.loc[[True,False,False,True]]

   english  id  math   name
0       89   1    90  Alice
3       94   4    78   Eric

### iloc

In [58]:
test_dict_df.set_index('name',inplace=True)

In [59]:
test_dict_df.iloc[1]

english    94
id          2
math       89
Name: Bob, dtype: int64

In [60]:
test_dict_df.iloc[[True,False,True]]

       english  id  math
name
Alice       89   1    90
Cindy       80   3    99

In [62]:
test_dict_df.iloc[1:2]

      english  id  math
name
Bob        94   2    89

In [68]:
test_dict_df.iloc[[1,2,4]]

       english  id  math
name
Bob         94   2    89
Cindy       80   3    99
Helen       94   5    97

### ix

In [71]:
test_dict_df

        english  id  math
name
Alice        89   1    90
Bob          94   2    89
Cindy        80   3    99
Eric         94   4    78
Helen        94   5    97
Grace        90   6    93
Tim          88   8    92

In [75]:
test_dict_df.ix['Alice']

english    89
id          1
math       90
Name: Alice, dtype: int64

In [80]:
test_dict_df

   english  id  math    name
0       89   1    90   Alice
1       94   2    89     Bob
2       80   3    99   Cindy
3       94   4    78    Eric
4       94   5    97   Helen
5       90   6    93  Grace
7       88   8    92     Tim

In [87]:
# test_dict_df.ix[6]
test_dict_df.iloc[6]

english     88
id           8
math        92
name       Tim
Name: 7, dtype: object

### at

In [89]:
test_dict_df

   english  id  math    name
0       89   1    90   Alice
1       94   2    89     Bob
2       80   3    99   Cindy
3       94   4    78    Eric
4       94   5    97   Helen
5       90   6    93  Grace
7       88   8    92     Tim

In [94]:
test_dict_df.at[1,'english']
test_dict_df.loc[1,'english']

94

In [98]:
test_dict_df.iat[2,2]

99